import React, { FC } from "react";
import MutItem from "./MutItem";
import s from './Mut.module.scss';

type TData = {
    id: string,
    title: string,
    content: string,
}

const data: TData[] = [
    {
        id: '1',
        title: 'Опрошенных пользовались микрокредитами',
        content: 'Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах'
    },
    {
        id: '2',
        title: 'Опрошенных пользовались микрокредитами',
        content: 'Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафахНе могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах'
    },
    {
        id: '3',
        title: 'Опрошенных пользовались микрокредитами',
        content: 'Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафахНе могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах'
    }, 
    {
        id: '4',
        title: 'Опрошенных пользовались микрокредитами',
        content: 'Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным деньгам помогает отказаться от кредитов и экономить деньги на процентах и штрафах'
    }
];

const Mut: FC = () => {

    return (
        <section className={s.mut}>
            <div className={s.container}>
                {data.map(item => <MutItem title={item.title} content={item.content} key={item.id}/>)}
            </div>
        </section>
    )
}

export default Mut;