import { AppDispatch } from "..";
import { TFaq } from "../../types/faqTypes";
import { faqSlice } from "../reducers/faqSlice";

const data: TFaq[]  = [
    {
        id: '1',
        title: 'Подтверждено: сознание наших соотечественников не замутнено пропагандой?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '2',
        title: 'Прототип нового сервиса - это как трубный призыв?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '3',
        title: 'Частокол на границе продолжает удивлять?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '4',
        title: 'Очевидцы сообщают, что слышали грохот грома градущих изменений?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '5',
        title: 'И по сей день в центральных регионах звучит перекатами печальный плач оппозиции?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '6',
        title: 'Нынче никто не может себе позволить инициировать треск разлетающихся скреп?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
    {
        id: '7',
        title: 'Высококачественный прототип будущего проекта обнадёживает?',
        content: 'В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.'
    },
]

export const getFaq = () => async (dispatch: AppDispatch) => {
    try {
        dispatch(faqSlice.actions.setLoading());
        //Тут типо fetch запрос
        dispatch(faqSlice.actions.setData(data));
    } catch (error: any) {
        dispatch(faqSlice.actions.setError(error.message));
    }
}