import { AppDispatch } from "..";
import { TRewiews } from "../../types/rewiewsType";
import { rewiewsSlice } from "../reducers/rewiewsSlice";

import user1 from '../../assets/user1.png';
import user2 from '../../assets/user2.png';


const data: TRewiews[] = [
    {
        id: '1',
        image: '',
        name: 'Константинов Михаил Павлович',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения. В своём стремлении улучшить пользовательский опыт мы ',
        country: 'Санкт-Петербург'
    },
    {
        id: '2',
        image: user1,
        name: 'Иван Иванов',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения. В своём стремлении улучшить пользовательский опыт мы упускаем, что активно развивающиеся страны третьего мира призваны к ответу.',
        country: 'Санкт-Петербург'
    },
    {
        id: '3',
        image: user2,
        name: 'Артем Корнилов',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения.',
        country: 'Самара'
    },
    {
        id: '4',
        image: user1,
        name: 'Артем Корнилов',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения. В своём стремлении улучшить пользовательский опыт мы ',
        country: 'Самара'
    },
    {
        id: '5',
        image: '',
        name: 'Иван Иванов',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения. В своём стремлении улучшить пользовательский опыт мы упускаем, что активно развивающиеся страны третьего мира призваны к ответу.',
        country: 'Санкт-Петербург'
    },
    {
        id: '6',
        image: user2,
        name: 'Константинов Михаил Павлович',
        content: 'Каждый из нас понимает очевидную вещь: перспективное планирование предоставляет широкие возможности для анализа существующих паттернов поведения.',
        country: 'Санкт-Петербург'
    },
]

export const getData = () => async (dispatch: AppDispatch) => {
    try {
        dispatch(rewiewsSlice.actions.setLoading());
        //Тут мог бы быть какой нибуть запрос к апишке
        dispatch(rewiewsSlice.actions.setData(data))
    } catch (error: any) {
        dispatch(rewiewsSlice.actions.setError(error.message))
    }
}